#ifndef _RH_DRV_H_
#define _RH_DRV_H_

#include <stdint.h>
/**
***********************************************************
* @brief 湿度传感器驱动初始化
* @param
* @return 
***********************************************************
*/
void HumiDrvInit(void);

/**
***********************************************************
* @brief 触发驱动转换湿度传感器数据
* @param
* @return 
***********************************************************
*/
void HumiSensorProc(uint8_t temp);

/**
***********************************************************
* @brief 获取湿度传感器数据
* @param
* @return 湿度数据，整数
***********************************************************
*/
float GetHumiData(void);
#endif
