#ifndef _NTC_DRV_H_
#define _NTC_DRV_H_

/**
***********************************************************
* @brief NTC驱动初始化
* @param
* @return 
***********************************************************
*/
void TempDrvInit(void);

/**
***********************************************************
* @brief 触发驱动转换温度传感器数据
* @param
* @return 
***********************************************************
*/
void TempSensorProc(void);

/**
***********************************************************
* @brief 获取温度传感器数据
* @param
* @return 温度数据，小数
***********************************************************
*/
float GetTempData(void);
#endif
